# pd.Series

In [71]:
import pandas as pd
import numpy as np

import warnings
warnings.filterwarnings('ignore')

A Series is a one-dimensional labeled array capable of holding any data type.

In [2]:
s = pd.Series([10,20,43,8],index=['a','b','c','d'])

In [3]:
s.values

array([10, 20, 43,  8])

In [4]:
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [5]:
s.dtype

dtype('int64')

DataFrame is a two dimensional labeled data structure - rows + columns ( like a sql table)

# pd.DataFrame

In [6]:
df = pd.DataFrame({
    'name':['Alice','Bob'],
    'age':[25,30],
    'salary':[5000,6000]
})

In [7]:
df.head()

    name  age  salary
0  Alice   25    5000
1    Bob   30    6000

In [8]:
df.tail()

    name  age  salary
0  Alice   25    5000
1    Bob   30    6000

In [9]:
df.shape

(2, 3)

In [10]:
df.columns

Index(['name', 'age', 'salary'], dtype='object')

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    2 non-null      object
 1   age     2 non-null      int64
 2   salary  2 non-null      int64
dtypes: int64(2), object(1)
memory usage: 180.0+ bytes

In [12]:
df.describe()

             age       salary
count   2.000000     2.000000
mean   27.500000  5500.000000
std     3.535534   707.106781
min    25.000000  5000.000000
25%    26.250000  5250.000000
50%    27.500000  5500.000000
75%    28.750000  5750.000000
max    30.000000  6000.000000

In [13]:
# df.to_csv('',index=False) 
# index = False : prevents pandas from writing the df index as a column

In [14]:
df

    name  age  salary
0  Alice   25    5000
1    Bob   30    6000

In [16]:
df['age']  # series

0    25
1    30
Name: age, dtype: int64

In [17]:
df[['age']] # df

   age
0   25
1   30

# Accessing & Filtering

In [18]:
df

    name  age  salary
0  Alice   25    5000
1    Bob   30    6000

In [27]:
df.loc[1] # 1 is the index here

name       Bob
age         30
salary    6000
Name: 1, dtype: object

In [29]:
df.iloc[0] # 0 is the position of the index

name      Alice
age          25
salary     5000
Name: 0, dtype: object

In [30]:
df.loc[1,'age']

np.int64(30)

In [40]:
df.iloc[:,1:3]

   age  salary
0   25    5000
1   30    6000

In [41]:
df

    name  age  salary
0  Alice   25    5000
1    Bob   30    6000

In [42]:
df[df['age']>25]

  name  age  salary
1  Bob   30    6000

In [43]:
df[(df['age']>25) & (df['salary']>55000)]

Empty DataFrame
Columns: [name, age, salary]
Index: []

In [44]:
df['bonus'] = df['salary'] * 0.10

In [45]:
df

    name  age  salary  bonus
0  Alice   25    5000  500.0
1    Bob   30    6000  600.0

In [46]:
df['senior'] = df['age']>28

# Handling Null Values

In [47]:
df

    name  age  salary  bonus  senior
0  Alice   25    5000  500.0   False
1    Bob   30    6000  600.0    True

In [48]:
df.isna()

    name    age  salary  bonus  senior
0  False  False   False  False   False
1  False  False   False  False   False

In [50]:
df.isna().sum(axis=1)

0    0
1    0
dtype: int64

In [51]:
df.isna().sum(axis=0)

name      0
age       0
salary    0
bonus     0
senior    0
dtype: int64

In [52]:
df.dropna()

    name  age  salary  bonus  senior
0  Alice   25    5000  500.0   False
1    Bob   30    6000  600.0    True

In [53]:
df.fillna(0)

    name  age  salary  bonus  senior
0  Alice   25    5000  500.0   False
1    Bob   30    6000  600.0    True

In [54]:
df.fillna(df.mean(numeric_only=True))

    name  age  salary  bonus  senior
0  Alice   25    5000  500.0   False
1    Bob   30    6000  600.0    True

In [119]:

df = pd.DataFrame({
    'employee_id': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    'employee_name': [
        'Alice Johnson', 'Bob Smith', 'Charlie Lee', 'Diana Patel',
        'Ethan Brown', 'Fiona Davis', 'George Miller', 'Hannah Wilson',
        'Ian Clark', 'Julia Martinez'
    ],
    'department': [
        'Engineering', 'Engineering', 'HR', 'Finance', 'Marketing',
        'Engineering', 'HR', 'Finance', 'Marketing', np.nan
    ],
    'manager_name': [
        'Sarah Kim', 'Sarah Kim', 'Michael Scott', 'Laura Chen',
        'David Lopez', 'Sarah Kim', np.nan, 'Laura Chen', 'David Lopez', 'Laura Chen'
    ],
    'salary': [
        90000, 85000, 60000, 75000, 70000,
        np.nan, 58000, 78000, 72000, 80000
    ],
    'years_experience': [
        5, 4, 3, 6, 4,
        2, np.nan, 7, 5, 6
    ]
})

df

,employee_id,employee_name,department,manager_name,salary,years_experience
0,101,Alice Johnson,Engineering,Sarah Kim,90000.0,5.0
1,102,Bob Smith,Engineering,Sarah Kim,85000.0,4.0
2,103,Charlie Lee,HR,Michael Scott,60000.0,3.0
3,104,Diana Patel,Finance,Laura Chen,75000.0,6.0
4,105,Ethan Brown,Marketing,David Lopez,70000.0,4.0
5,106,Fiona Davis,Engineering,Sarah Kim,NaN,2.0
6,107,George Miller,HR,NaN,58000.0,NaN
7,108,Hannah Wilson,Finance,Laura Chen,78000.0,7.0
8,109,Ian Clark,Marketing,David Lopez,72000.0,5.0
9,110,Julia Martinez,NaN,Laura Chen,80000.0,6.0

In [120]:
df.isna().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    1
6    2
7    0
8    0
9    1
dtype: int64

In [121]:
df.fillna(0)

,employee_id,employee_name,department,manager_name,salary,years_experience
0,101,Alice Johnson,Engineering,Sarah Kim,90000.0,5.0
1,102,Bob Smith,Engineering,Sarah Kim,85000.0,4.0
2,103,Charlie Lee,HR,Michael Scott,60000.0,3.0
3,104,Diana Patel,Finance,Laura Chen,75000.0,6.0
4,105,Ethan Brown,Marketing,David Lopez,70000.0,4.0
5,106,Fiona Davis,Engineering,Sarah Kim,0.0,2.0
6,107,George Miller,HR,0,58000.0,0.0
7,108,Hannah Wilson,Finance,Laura Chen,78000.0,7.0
8,109,Ian Clark,Marketing,David Lopez,72000.0,5.0
9,110,Julia Martinez,0,Laura Chen,80000.0,6.0

In [122]:
# filling the missing value with mode
mode_years_experience = df['years_experience'].mode()[0] 
df['years_experience'].fillna(mode_years_experience,inplace = True)

In [123]:
df['years_experience'].isna().sum()

np.int64(0)

In [124]:
df.describe(include='O').T

              count unique            top freq
employee_name    10     10  Alice Johnson    1
department        9      4    Engineering    3
manager_name      9      4      Sarah Kim    3

In [125]:
df

,employee_id,employee_name,department,manager_name,salary,years_experience
0,101,Alice Johnson,Engineering,Sarah Kim,90000.0,5.0
1,102,Bob Smith,Engineering,Sarah Kim,85000.0,4.0
2,103,Charlie Lee,HR,Michael Scott,60000.0,3.0
3,104,Diana Patel,Finance,Laura Chen,75000.0,6.0
4,105,Ethan Brown,Marketing,David Lopez,70000.0,4.0
5,106,Fiona Davis,Engineering,Sarah Kim,NaN,2.0
6,107,George Miller,HR,NaN,58000.0,4.0
7,108,Hannah Wilson,Finance,Laura Chen,78000.0,7.0
8,109,Ian Clark,Marketing,David Lopez,72000.0,5.0
9,110,Julia Martinez,NaN,Laura Chen,80000.0,6.0

In [126]:
df['salary'].mean()

np.float64(74222.22222222222)

In [127]:
df['salary'].fillna(df['salary'].mean(),inplace = True)

# Groupby Aggregation

In [128]:
df

,employee_id,employee_name,department,manager_name,salary,years_experience
0,101,Alice Johnson,Engineering,Sarah Kim,90000.000000,5.0
1,102,Bob Smith,Engineering,Sarah Kim,85000.000000,4.0
2,103,Charlie Lee,HR,Michael Scott,60000.000000,3.0
3,104,Diana Patel,Finance,Laura Chen,75000.000000,6.0
4,105,Ethan Brown,Marketing,David Lopez,70000.000000,4.0
5,106,Fiona Davis,Engineering,Sarah Kim,74222.222222,2.0
6,107,George Miller,HR,NaN,58000.000000,4.0
7,108,Hannah Wilson,Finance,Laura Chen,78000.000000,7.0
8,109,Ian Clark,Marketing,David Lopez,72000.000000,5.0
9,110,Julia Martinez,NaN,Laura Chen,80000.000000,6.0

In [129]:
df.groupby('department')[['salary']].mean()

                   salary
department
Engineering  83074.074074
Finance      76500.000000
HR           59000.000000
Marketing    71000.000000

In [130]:
df.groupby('department')[['salary']].agg(['mean','max','min','count'])

                   salary
                     mean      max           min count
department
Engineering  83074.074074  90000.0  74222.222222     3
Finance      76500.000000  78000.0  75000.000000     2
HR           59000.000000  60000.0  58000.000000     2
Marketing    71000.000000  72000.0  70000.000000     2

In [131]:
df.groupby(['department','manager_name'])[['salary']].mean()

                                 salary
department  manager_name
Engineering Sarah Kim      83074.074074
Finance     Laura Chen     76500.000000
HR          Michael Scott  60000.000000
Marketing   David Lopez    71000.000000

In [132]:
df.groupby(['department','manager_name'])[['salary']].mean().reset_index()

    department   manager_name        salary
0  Engineering      Sarah Kim  83074.074074
1      Finance     Laura Chen  76500.000000
2           HR  Michael Scott  60000.000000
3    Marketing    David Lopez  71000.000000

In [133]:
df.groupby('department').agg({
    'salary':'max',
    'years_experience':'mean'
})

              salary  years_experience
department
Engineering  90000.0          3.666667
Finance      78000.0          6.500000
HR           60000.0          3.500000
Marketing    72000.0          4.500000

In [134]:
df.groupby('department').agg({
    'salary': ['mean', 'max', lambda x: x.max() - x.min()],
    'years_experience': ['mean', lambda x: x.max() - x.min()]
})

                   salary                        years_experience
                     mean      max    <lambda_0>             mean <lambda_0>
department
Engineering  83074.074074  90000.0  15777.777778         3.666667        3.0
Finance      76500.000000  78000.0   3000.000000         6.500000        1.0
HR           59000.000000  60000.0   2000.000000         3.500000        1.0
Marketing    71000.000000  72000.0   2000.000000         4.500000        1.0

In [135]:
df.groupby('department').apply(lambda x: x.nlargest(2, 'salary'))

               employee_id  employee_name   department   manager_name  \
department
Engineering 0          101  Alice Johnson  Engineering      Sarah Kim
            1          102      Bob Smith  Engineering      Sarah Kim
Finance     7          108  Hannah Wilson      Finance     Laura Chen
            3          104    Diana Patel      Finance     Laura Chen
HR          2          103    Charlie Lee           HR  Michael Scott
            6          107  George Miller           HR            NaN
Marketing   8          109      Ian Clark    Marketing    David Lopez
            4          105    Ethan Brown    Marketing    David Lopez

                salary  years_experience
department
Engineering 0  90000.0               5.0
            1  85000.0               4.0
Finance     7  78000.0               7.0
            3  75000.0               6.0
HR          2  60000.0               3.0
            6  58000.0               4.0
Marketing   8  72000.0               5.0
            4  70000.0               4.0

In [136]:
df.groupby('department').agg(
    average_salary=('salary', 'mean'),
    max_salary=('salary', 'max'),
    experience_range=('years_experience', lambda x: x.max() - x.min())
)

             average_salary  max_salary  experience_range
department
Engineering    83074.074074     90000.0               3.0
Finance        76500.000000     78000.0               1.0
HR             59000.000000     60000.0               1.0
Marketing      71000.000000     72000.0               1.0

In [137]:
# Only employees with salary > 70000
df[df['salary'] > 70000].groupby('department').agg(
    avg_salary=('salary', 'mean'),
    max_salary=('salary', 'max')
)

               avg_salary  max_salary
department
Engineering  83074.074074     90000.0
Finance      76500.000000     78000.0
Marketing    72000.000000     72000.0

# Map/Transform/Apply

In [138]:
def seniority(row):
    if row['years_experience']>=6:
        return 'Senior'
    elif row['years_experience']>=4:
        return 'Mid'
    else:
        return 'Junior'

df['seniority'] = df.apply(seniority,axis=1)

In [139]:
df[['employee_name','years_experience','seniority']]

    employee_name  years_experience seniority
0   Alice Johnson               5.0       Mid
1       Bob Smith               4.0       Mid
2     Charlie Lee               3.0    Junior
3     Diana Patel               6.0    Senior
4     Ethan Brown               4.0       Mid
5     Fiona Davis               2.0    Junior
6   George Miller               4.0       Mid
7   Hannah Wilson               7.0    Senior
8       Ian Clark               5.0       Mid
9  Julia Martinez               6.0    Senior

In [140]:
df[['salary', 'years_experience']].apply(
    lambda col: col / col.max()
)

     salary  years_experience
0  1.000000          0.714286
1  0.944444          0.571429
2  0.666667          0.428571
3  0.833333          0.857143
4  0.777778          0.571429
5  0.824691          0.285714
6  0.644444          0.571429
7  0.866667          1.000000
8  0.800000          0.714286
9  0.888889          0.857143

In [141]:
# For each column, get its type and number of missing values
def col_info(col):
    return pd.Series({
        'dtype': col.dtype,
        'num_missing': col.isna().sum(),
        'num_unique': col.nunique()
    })

df.apply(col_info, axis=0)

,employee_id,employee_name,department,manager_name,salary,years_experience,seniority
dtype,int64,object,object,object,float64,float64,object
num_missing,0,0,1,1,0,0,0
num_unique,10,10,4,4,10,6,3

In [142]:
# For numeric columns, compute mean, std, and range
def col_stats(col):
    if col.dtype in ['int64', 'float64']:
        return pd.Series({
            'mean': col.mean(),
            'std': col.std(),
            'range': col.max() - col.min()
        })

df.apply(col_stats, axis=0)

,employee_id,employee_name,department,manager_name,salary,years_experience,seniority
mean,105.50000,None,None,None,74222.222222,4.600000,None
std,3.02765,None,None,None,10008.638244,1.505545,None
range,9.00000,None,None,None,32000.000000,5.000000,None

In [143]:
# Add 10% bonus to salary
df['bonus'] = df['salary'].map(lambda x: x * 0.10)

In [144]:
dept_map = {'Engineering': 'Eng', 'Finance': 'Fin', 'HR': 'HR', 'Marketing': 'Mkt'}
df['dept_short'] = df['department'].map(dept_map)

In [145]:
df

,employee_id,employee_name,department,manager_name,salary,years_experience,seniority,bonus,dept_short
0,101,Alice Johnson,Engineering,Sarah Kim,90000.000000,5.0,Mid,9000.000000,Eng
1,102,Bob Smith,Engineering,Sarah Kim,85000.000000,4.0,Mid,8500.000000,Eng
2,103,Charlie Lee,HR,Michael Scott,60000.000000,3.0,Junior,6000.000000,HR
3,104,Diana Patel,Finance,Laura Chen,75000.000000,6.0,Senior,7500.000000,Fin
4,105,Ethan Brown,Marketing,David Lopez,70000.000000,4.0,Mid,7000.000000,Mkt
5,106,Fiona Davis,Engineering,Sarah Kim,74222.222222,2.0,Junior,7422.222222,Eng
6,107,George Miller,HR,NaN,58000.000000,4.0,Mid,5800.000000,HR
7,108,Hannah Wilson,Finance,Laura Chen,78000.000000,7.0,Senior,7800.000000,Fin
8,109,Ian Clark,Marketing,David Lopez,72000.000000,5.0,Mid,7200.000000,Mkt
9,110,Julia Martinez,NaN,Laura Chen,80000.000000,6.0,Senior,8000.000000,NaN

In [146]:
# Give a 5% salary hike to employees with experience > 5
df['salary'] = df['salary'] + 0.05 * df['salary'] * (df['years_experience'] > 5)

In [147]:
df

,employee_id,employee_name,department,manager_name,salary,years_experience,seniority,bonus,dept_short
0,101,Alice Johnson,Engineering,Sarah Kim,90000.000000,5.0,Mid,9000.000000,Eng
1,102,Bob Smith,Engineering,Sarah Kim,85000.000000,4.0,Mid,8500.000000,Eng
2,103,Charlie Lee,HR,Michael Scott,60000.000000,3.0,Junior,6000.000000,HR
3,104,Diana Patel,Finance,Laura Chen,78750.000000,6.0,Senior,7500.000000,Fin
4,105,Ethan Brown,Marketing,David Lopez,70000.000000,4.0,Mid,7000.000000,Mkt
5,106,Fiona Davis,Engineering,Sarah Kim,74222.222222,2.0,Junior,7422.222222,Eng
6,107,George Miller,HR,NaN,58000.000000,4.0,Mid,5800.000000,HR
7,108,Hannah Wilson,Finance,Laura Chen,81900.000000,7.0,Senior,7800.000000,Fin
8,109,Ian Clark,Marketing,David Lopez,72000.000000,5.0,Mid,7200.000000,Mkt
9,110,Julia Martinez,NaN,Laura Chen,84000.000000,6.0,Senior,8000.000000,NaN

In [148]:
df['dept_avg_salary'] = df.groupby('department')['salary'].transform('mean')
df['above_avg'] = df['salary'] > df['dept_avg_salary']

In [149]:
df

,employee_id,employee_name,department,manager_name,salary,years_experience,seniority,bonus,dept_short,dept_avg_salary,above_avg
0,101,Alice Johnson,Engineering,Sarah Kim,90000.000000,5.0,Mid,9000.000000,Eng,83074.074074,True
1,102,Bob Smith,Engineering,Sarah Kim,85000.000000,4.0,Mid,8500.000000,Eng,83074.074074,True
2,103,Charlie Lee,HR,Michael Scott,60000.000000,3.0,Junior,6000.000000,HR,59000.000000,True
3,104,Diana Patel,Finance,Laura Chen,78750.000000,6.0,Senior,7500.000000,Fin,80325.000000,False
4,105,Ethan Brown,Marketing,David Lopez,70000.000000,4.0,Mid,7000.000000,Mkt,71000.000000,False
5,106,Fiona Davis,Engineering,Sarah Kim,74222.222222,2.0,Junior,7422.222222,Eng,83074.074074,False
6,107,George Miller,HR,NaN,58000.000000,4.0,Mid,5800.000000,HR,59000.000000,False
7,108,Hannah Wilson,Finance,Laura Chen,81900.000000,7.0,Senior,7800.000000,Fin,80325.000000,True
8,109,Ian Clark,Marketing,David Lopez,72000.000000,5.0,Mid,7200.000000,Mkt,71000.000000,True
9,110,Julia Martinez,NaN,Laura Chen,84000.000000,6.0,Senior,8000.000000,NaN,NaN,False

In [150]:
# Round salary to nearest 1000 and add $500 bonus in one line
df['adjusted_salary'] = df['salary'].apply(lambda x: round(x, -3) + 500)

In [151]:
# Percent difference from department average
df['pct_diff'] = df['salary'].transform(lambda x: (x - x.mean()) / x.mean() * 100)

# Concat - Merge - Join

## concat : horizontal, vertical

In [152]:
import pandas as pd

# First dataset
df1 = pd.DataFrame({
    'employee_id': [101, 102, 103],
    'employee_name': ['Alice', 'Bob', 'Charlie'],
    'department': ['Engineering', 'Engineering', 'HR']
})

# Second dataset
df2 = pd.DataFrame({
    'employee_id': [104, 105, 106],
    'employee_name': ['Diana', 'Ethan', 'Fiona'],
    'department': ['Finance', 'Marketing', 'Engineering']
})

display(df1)
display(df2)

# Vertical concatenation (stack rows)
df_vertical = pd.concat([df1, df2], ignore_index=True)
df_vertical

   employee_id employee_name   department
0          101         Alice  Engineering
1          102           Bob  Engineering
2          103       Charlie           HR

   employee_id employee_name   department
0          104         Diana      Finance
1          105         Ethan    Marketing
2          106         Fiona  Engineering

   employee_id employee_name   department
0          101         Alice  Engineering
1          102           Bob  Engineering
2          103       Charlie           HR
3          104         Diana      Finance
4          105         Ethan    Marketing
5          106         Fiona  Engineering

In [155]:
df3 = pd.DataFrame({
    'salary':[90000,85000,60000]
})

pd.concat([df1,df3],axis=1)

   employee_id employee_name   department  salary
0          101         Alice  Engineering   90000
1          102           Bob  Engineering   85000
2          103       Charlie           HR   60000

## pd.merge

In [156]:
df_budget = pd.DataFrame({
    'department': ['Engineering', 'Finance', 'HR', 'Marketing'],
    'budget': [300000, 150000, 100000, 120000]
})

display(df_budget)

# Merge employee data with budget info
df_merged = pd.merge(df_vertical, df_budget, on='department', how='left')
df_merged

    department  budget
0  Engineering  300000
1      Finance  150000
2           HR  100000
3    Marketing  120000

   employee_id employee_name   department  budget
0          101         Alice  Engineering  300000
1          102           Bob  Engineering  300000
2          103       Charlie           HR  100000
3          104         Diana      Finance  150000
4          105         Ethan    Marketing  120000
5          106         Fiona  Engineering  300000

In [158]:
# Suppose some departments are missing in budget
df_budget2 = pd.DataFrame({
    'department': ['Engineering', 'Finance'],
    'budget': [300000, 150000]
})

display(df_vertical)
display(df_budget2) 

# Left join (keep all employees)
display(pd.merge(df_vertical, df_budget2, on='department', how='left'))

# Inner join (only matching departments)
display(pd.merge(df_vertical, df_budget2, on='department', how='inner'))

   employee_id employee_name   department
0          101         Alice  Engineering
1          102           Bob  Engineering
2          103       Charlie           HR
3          104         Diana      Finance
4          105         Ethan    Marketing
5          106         Fiona  Engineering

    department  budget
0  Engineering  300000
1      Finance  150000

   employee_id employee_name   department    budget
0          101         Alice  Engineering  300000.0
1          102           Bob  Engineering  300000.0
2          103       Charlie           HR       NaN
3          104         Diana      Finance  150000.0
4          105         Ethan    Marketing       NaN
5          106         Fiona  Engineering  300000.0

   employee_id employee_name   department  budget
0          101         Alice  Engineering  300000
1          102           Bob  Engineering  300000
2          104         Diana      Finance  150000
3          106         Fiona  Engineering  300000

In [160]:
df_projects = pd.DataFrame({
    'department': ['Engineering', 'Engineering', 'HR'],
    'employee_name': ['Alice', 'Fiona', 'Charlie'],
    'project': ['Project X', 'Project Y', 'Project Z']
})
display(df_projects)
# Merge on department + employee_name
df_full = pd.merge(df_vertical, df_projects, on=['department', 'employee_name'], how='left')
df_full

    department employee_name    project
0  Engineering         Alice  Project X
1  Engineering         Fiona  Project Y
2           HR       Charlie  Project Z

   employee_id employee_name   department    project
0          101         Alice  Engineering  Project X
1          102           Bob  Engineering        NaN
2          103       Charlie           HR  Project Z
3          104         Diana      Finance        NaN
4          105         Ethan    Marketing        NaN
5          106         Fiona  Engineering  Project Y

## .join method ( how='left' ) : index based

In [161]:
# Set index to employee_id
df_vertical_indexed = df_vertical.set_index('employee_id')
df_salary = pd.DataFrame({
    'employee_id': [101, 102, 103],
    'salary': [90000, 85000, 60000]
}).set_index('employee_id')

display(df_vertical_indexed)
display(df_salary)

# Join on index
df_joined = df_vertical_indexed.join(df_salary,how='left')
df_joined

            employee_name   department
employee_id
101                 Alice  Engineering
102                   Bob  Engineering
103               Charlie           HR
104                 Diana      Finance
105                 Ethan    Marketing
106                 Fiona  Engineering

             salary
employee_id
101           90000
102           85000
103           60000

            employee_name   department   salary
employee_id
101                 Alice  Engineering  90000.0
102                   Bob  Engineering  85000.0
103               Charlie           HR  60000.0
104                 Diana      Finance      NaN
105                 Ethan    Marketing      NaN
106                 Fiona  Engineering      NaN

## pd.merge : Left_index , Right_index

In [163]:
df_proj = pd.DataFrame({
    'project': ['Project X', 'Project Y', 'Project Z']
}, index=[101, 102, 104])  # 104 does not exist in df_emp

# Left join using index
pd.merge(df_emp, df_proj, left_index=True, right_index=True, how='left')

   emp_id employee_name   department project
0     101         Alice  Engineering     NaN
1     102           Bob  Engineering     NaN
2     103       Charlie           HR     NaN

## pd.merge : Left_on, Right_on

In [162]:
# Left DataFrame
df_emp = pd.DataFrame({
    'emp_id': [101, 102, 103],
    'employee_name': ['Alice', 'Bob', 'Charlie'],
    'department': ['Engineering', 'Engineering', 'HR']
})

# Right DataFrame
df_salary = pd.DataFrame({
    'employee_number': [101, 102, 103],
    'salary': [90000, 85000, 60000]
})

# Merge using left_on and right_on
df_merged = pd.merge(df_emp, df_salary, left_on='emp_id', right_on='employee_number', how='left')
df_merged

   emp_id employee_name   department  employee_number  salary
0     101         Alice  Engineering              101   90000
1     102           Bob  Engineering              102   85000
2     103       Charlie           HR              103   60000

# Pivot Tables

In [5]:

import pandas as pd

# Sample data
data = {
    "Date": ["2026-01-01", "2026-01-01", "2026-01-02", "2026-01-02"],
    "Product": ["A", "B", "A", "B"],
    "Region": ["North", "South", "North", "South"],
    "Sales": [100, 200, 150, 250]
}

df = pd.DataFrame(data)
display(df)

# Create a pivot table
pivot = pd.pivot_table(
    df, 
    values="Sales",        # Column to aggregate
    index="Product",       # Rows
    columns="Region",      # Columns
    aggfunc="sum",         # Aggregation function
    fill_value=0           # Replace NaN with 0
)

display(pivot)

         Date Product Region  Sales
0  2026-01-01       A  North    100
1  2026-01-01       B  South    200
2  2026-01-02       A  North    150
3  2026-01-02       B  South    250

Region   North  South
Product
A          250      0
B            0    450

In [7]:
import pandas as pd

# Sample data
data = {
    "Date": ["2026-01-01", "2026-01-01", "2026-01-02", "2026-01-02", "2026-01-03", "2026-01-03"],
    "Product": ["A", "B", "A", "B", "A", "B"],
    "Region": ["North", "South", "North", "South", "North", "South"],
    "Sales": [100, 200, 150, 250, 120, 300]
}

df = pd.DataFrame(data)
display(df)

# Custom function: range
def sales_range(x):
    return x.max() - x.min()

# Pivot table with multiple aggregation functions
pivot_multi = pd.pivot_table(
    df,
    values="Sales",
    index="Product",
    columns="Region",
    aggfunc=["sum", "max", sales_range],  # multiple aggregations
    fill_value=0
)

display(pivot_multi)

         Date Product Region  Sales
0  2026-01-01       A  North    100
1  2026-01-01       B  South    200
2  2026-01-02       A  North    150
3  2026-01-02       B  South    250
4  2026-01-03       A  North    120
5  2026-01-03       B  South    300

          sum         max       sales_range
Region  North South North South       North South
Product
A         370     0   150     0          50     0
B           0   750     0   300           0   100

In [10]:
import pandas as pd

# Sample data
data = {
    "Date": ["2026-01-01", "2026-01-01", "2026-01-02", "2026-01-02", "2026-01-03", "2026-01-03"],
    "Product": ["A", "B", "A", "B", "A", "B"],
    "Region": ["North", "South", "North", "South", "North", "South"],
    "Category": ["Electronics", "Electronics", "Furniture", "Furniture", "Electronics", "Furniture"],
    "Sales": [100, 200, 150, 250, 120, 300]
}

df = pd.DataFrame(data)
display(df)

# Custom function
def sales_range(x):
    return x.max() - x.min()

# Pivot table with multiple rows and columns
pivot_multi_dim = pd.pivot_table(
    df,
    values="Sales",
    index=["Product", "Category"],   # multiple rows
    columns=["Region"],      # multiple columns
    aggfunc=["sum", sales_range],      # multiple aggregation functions
    fill_value=0
)

display(pivot_multi_dim)

         Date Product Region     Category  Sales
0  2026-01-01       A  North  Electronics    100
1  2026-01-01       B  South  Electronics    200
2  2026-01-02       A  North    Furniture    150
3  2026-01-02       B  South    Furniture    250
4  2026-01-03       A  North  Electronics    120
5  2026-01-03       B  South    Furniture    300

                      sum       sales_range
Region              North South       North South
Product Category
A       Electronics   220     0          20     0
        Furniture     150     0           0     0
B       Electronics     0   200           0     0
        Furniture       0   550           0    50

In [11]:
import pandas as pd

# Sample sales data
data = {
    "Product": ["A", "B", "A", "B", "C", "C"],
    "Region": ["North", "North", "South", "South", "North", "South"],
    "Sales": [100, 150, 200, 250, 300, 350]
}

df = pd.DataFrame(data)
display(df)

# Pivot table with totals
pivot = pd.pivot_table(
    df,
    values="Sales",
    index="Product",
    columns="Region",
    aggfunc="sum",
    fill_value=0,
    margins=True,          # Add totals
    margins_name="Total"   # Name of the totals row/column
)

display(pivot)

  Product Region  Sales
0       A  North    100
1       B  North    150
2       A  South    200
3       B  South    250
4       C  North    300
5       C  South    350

Region   North  South  Total
Product
A          100    200    300
B          150    250    400
C          300    350    650
Total      550    800   1350

# Sorting & Ranking

In [15]:
import pandas as pd

data = {
    "Product": ["A", "B", "C", "A", "B", "C"],
    "Sales": [100, 150, 300, 200, 250, 200],
    "Region": ["North", "North", "North", "South", "South", "South"]
}

df = pd.DataFrame(data)
display(df)

  Product  Sales Region
0       A    100  North
1       B    150  North
2       C    300  North
3       A    200  South
4       B    250  South
5       C    200  South

In [16]:
# Sort by Sales ascending
df_sorted = df.sort_values(by="Sales")
display(df_sorted)

  Product  Sales Region
0       A    100  North
1       B    150  North
3       A    200  South
5       C    200  South
4       B    250  South
2       C    300  North

In [17]:
# Sort by Sales descending
df_sorted_desc = df.sort_values(by="Sales", ascending=False)
display(df_sorted_desc)

  Product  Sales Region
2       C    300  North
4       B    250  South
3       A    200  South
5       C    200  South
1       B    150  North
0       A    100  North

In [18]:
# Sort by multiple columns
df_sorted_multi = df.sort_values(by=["Region", "Sales"], ascending=[True, False])
df_sorted_multi

  Product  Sales Region
2       C    300  North
1       B    150  North
0       A    100  North
4       B    250  South
3       A    200  South
5       C    200  South

In [20]:
# sort_index() 
df.set_index("Product").sort_index()

         Sales Region
Product
A          100  North
A          200  South
B          150  North
B          250  South
C          300  North
C          200  South

In [21]:
df["Sales_rank"] = df["Sales"].rank()
df # by default rank method is avg

  Product  Sales Region  Sales_rank
0       A    100  North         1.0
1       B    150  North         2.0
2       C    300  North         6.0
3       A    200  South         3.5
4       B    250  South         5.0
5       C    200  South         3.5

In [23]:
df["Sales_rank_dense"] = df["Sales"].rank(method="dense", ascending=True)
df # if tie then same rank

  Product  Sales Region  Sales_rank  Sales_rank_dense
0       A    100  North         1.0               1.0
1       B    150  North         2.0               2.0
2       C    300  North         6.0               5.0
3       A    200  South         3.5               3.0
4       B    250  South         5.0               4.0
5       C    200  South         3.5               3.0

In [24]:
df["Sales_rank_max"] = df["Sales"].rank(method="max", ascending=True)
df

  Product  Sales Region  Sales_rank  Sales_rank_dense  Sales_rank_max
0       A    100  North         1.0               1.0             1.0
1       B    150  North         2.0               2.0             2.0
2       C    300  North         6.0               5.0             6.0
3       A    200  South         3.5               3.0             4.0
4       B    250  South         5.0               4.0             5.0
5       C    200  South         3.5               3.0             4.0

In [25]:
df["Sales_rank_min"] = df["Sales"].rank(method="min", ascending=True)
df

,Product,Sales,Region,Sales_rank,Sales_rank_dense,Sales_rank_max,Sales_rank_min
0,A,100,North,1.0,1.0,1.0,1.0
1,B,150,North,2.0,2.0,2.0,2.0
2,C,300,North,6.0,5.0,6.0,6.0
3,A,200,South,3.5,3.0,4.0,3.0
4,B,250,South,5.0,4.0,5.0,5.0
5,C,200,South,3.5,3.0,4.0,3.0

In [26]:
import pandas as pd

data = {
    "Product": ["A", "B", "C", "D", "E"],
    "Sales": [100, 250, 150, 300, 200]
}

df = pd.DataFrame(data)
display(df)
# Top 3 sales
top3 = df.nlargest(3, "Sales")
top3

  Product  Sales
0       A    100
1       B    250
2       C    150
3       D    300
4       E    200

  Product  Sales
3       D    300
1       B    250
4       E    200

# Time Series Functionalities

In [39]:
import pandas as pd

data = {
    "Date": ["2026-01-01 08:00", "2026-01-01 12:00", "2026-01-02 09:30", "2026-01-03 18:45"],
    "Sales": [100, 150, 200, 250]
}

df = pd.DataFrame(data)
display(df)

# Convert to datetime
df["Date"] = pd.to_datetime(df["Date"])

               Date  Sales
0  2026-01-01 08:00    100
1  2026-01-01 12:00    150
2  2026-01-02 09:30    200
3  2026-01-03 18:45    250

In [40]:
df.dtypes

Date     datetime64[ns]
Sales             int64
dtype: object

In [41]:
df["Year"] = df["Date"].dt.year
df["Month"] = df["Date"].dt.month
df["Day"] = df["Date"].dt.day
df["Weekday"] = df["Date"].dt.weekday  # 0=Monday, 6=Sunday
df["Hour"] = df["Date"].dt.hour

display(df)

                 Date  Sales  Year  Month  Day  Weekday  Hour
0 2026-01-01 08:00:00    100  2026      1    1        3     8
1 2026-01-01 12:00:00    150  2026      1    1        3    12
2 2026-01-02 09:30:00    200  2026      1    2        4     9
3 2026-01-03 18:45:00    250  2026      1    3        5    18

In [42]:
# Set Date as index
df.set_index("Date", inplace=True)

# Daily sum of sales
daily_sales = df["Sales"].resample("D").sum()
daily_sales

Date
2026-01-01    250
2026-01-02    200
2026-01-03    250
Freq: D, Name: Sales, dtype: int64

In [43]:
# Weekly sum
weekly_sales = df["Sales"].resample("W").sum()
weekly_sales

Date
2026-01-04    700
Freq: W-SUN, Name: Sales, dtype: int64

In [47]:
# 2-day rolling sum
df['rolling_sum']= df["Sales"].rolling(window=2).sum()

# Expanding sum (cumulative sum)
df['expanding_sum'] = df["Sales"].expanding().sum()
df

,Sales,Year,Month,Day,Weekday,Hour,rolling_sum,expanding_sum
Date,,,,,,,,
2026-01-01 08:00:00,100,2026,1,1,3,8,NaN,100.0
2026-01-01 12:00:00,150,2026,1,1,3,12,250.0,250.0
2026-01-02 09:30:00,200,2026,1,2,4,9,350.0,450.0
2026-01-03 18:45:00,250,2026,1,3,5,18,450.0,700.0

In [48]:
# | Code | Meaning                 | Example          |
# | ---- | ----------------------- | ---------------- |
# | `%d` | Day of month (0131)    | `01`, `10`, `31` |
# | `%m` | Month as number (0112) | `01`, `12`, `04` |
# | `%y` | 2-digit year            | `23`  2023      |
# | `%Y` | 4-digit year            | `2023`           |
# | `%H` | Hour (0023)            | `08`, `18`       |
# | `%M` | Minute (0059)          | `00`, `45`       |
# | `%S` | Second (0059)          | `00`, `30`       |

In [49]:
import pandas as pd

data = {
    "Day": [1, 2, 3, 4],
    "Sales": [100, 150, 200, 250]
}

df = pd.DataFrame(data)


# Lag of 1 period
df["Sales_Lag1"] = df["Sales"].shift(1)

# Lead of 1 period
df["Sales_Lead1"] = df["Sales"].shift(-1)

display(df)

   Day  Sales  Sales_Lag1  Sales_Lead1
0    1    100         NaN        150.0
1    2    150       100.0        200.0
2    3    200       150.0        250.0
3    4    250       200.0          NaN

In [50]:
data = {
    "Region": ["North", "North", "North", "South", "South", "South"],
    "Day": [1, 2, 3, 1, 2, 3],
    "Sales": [100, 150, 200, 50, 80, 120]
}

df = pd.DataFrame(data)

# Lag per region
df["Lag1"] = df.groupby("Region")["Sales"].shift(1)
df["Lead1"] = df.groupby("Region")["Sales"].shift(-1)

display(df)

  Region  Day  Sales   Lag1  Lead1
0  North    1    100    NaN  150.0
1  North    2    150  100.0  200.0
2  North    3    200  150.0    NaN
3  South    1     50    NaN   80.0
4  South    2     80   50.0  120.0
5  South    3    120   80.0    NaN

# Index/Multi-Indexing

In [51]:
data = {
    "Region": ["North", "North", "South", "South"],
    "Product": ["A", "B", "A", "B"],
    "Sales": [100, 150, 200, 250]
}

df = pd.DataFrame(data)

# Set multi-level index
df_multi = df.set_index(["Region", "Product"])
display(df_multi)

                Sales
Region Product
North  A          100
       B          150
South  A          200
       B          250

In [52]:
df_multi_reset = df_multi.reset_index()
df_multi_reset

  Region Product  Sales
0  North       A    100
1  North       B    150
2  South       A    200
3  South       B    250

In [53]:
df_multi.sort_index(level=["Region", "Product"], ascending=[True, False])

                Sales
Region Product
North  B          150
       A          100
South  B          250
       A          200

In [55]:
df_multi.swaplevel("Region", "Product")

                Sales
Product Region
A       North     100
B       North     150
A       South     200
B       South     250

In [56]:
df_multi.xs("North", level="Region")

         Sales
Product
A          100
B          150

In [57]:
df_multi.xs("B", level="Product")

        Sales
Region
North     150
South     250

In [58]:
print(df_multi.index.levels)  # list of all level labels
print(df_multi.index.names)   # names of index levels

[['North', 'South'], ['A', 'B']]
['Region', 'Product']

In [59]:
print(df_multi.index.get_level_values("Region"))

Index(['North', 'North', 'South', 'South'], dtype='object', name='Region')

In [61]:
df_multi_dropped = df_multi.droplevel("Product")
print(df_multi_dropped)

        Sales
Region
North     100
North     150
South     200
South     250

In [64]:
df_multi.loc[("North", "A")]  # specific row

Sales    100
Name: (North, A), dtype: int64

In [65]:
df_multi.loc["North"]          # all products in North

         Sales
Product
A          100
B          150

# Duplicates

In [73]:
import pandas as pd

df = pd.DataFrame({
    "OrderID": [1, 2, 2, 3, 4, 4],
    "Product": ["A", "B", "B", "C", "D", "D"],
    "Sales": [100, 200, 200, 300, 400, 400],
})
df

   OrderID Product  Sales
0        1       A    100
1        2       B    200
2        2       B    200
3        3       C    300
4        4       D    400
5        4       D    400

In [77]:
df.duplicated(subset=['OrderID','Product'])

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [78]:
df.duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

# Type Conversions

In [80]:
df = pd.DataFrame({
    "Sales": ["100", "200", "300"],
    "Discount": [0.1, 0.2, 0.3]
})

df["Sales"] = df["Sales"].astype(int)
df["Discount"] = df["Discount"].astype("float32")

df.dtypes

Sales         int64
Discount    float32
dtype: object

# melt

In [82]:
df = pd.DataFrame({
    "Product": ["A", "B"],
    "Jan": [100, 200],
    "Feb": [150, 250],
    "Mar": [180, 300]
})

df_long = pd.melt(
    df,
    id_vars=["Product"],
    value_vars=["Jan", "Feb", "Mar"],
    var_name="Month",
    value_name="Sales"
)

display(df)
display(df_long)

  Product  Jan  Feb  Mar
0       A  100  150  180
1       B  200  250  300

  Product Month  Sales
0       A   Jan    100
1       B   Jan    200
2       A   Feb    150
3       B   Feb    250
4       A   Mar    180
5       B   Mar    300

# stack/unstack

In [84]:
df = pd.DataFrame({
    "North": [100, 200],
    "South": [150, 250]
}, index=["A", "B"])

display(df) 

# Columns  rows
stacked = df.stack()

   North  South
A    100    150
B    200    250

In [85]:
stacked

A  North    100
   South    150
B  North    200
   South    250
dtype: int64

In [87]:
stacked.unstack()

   North  South
A    100    150
B    200    250

# Using Memory Efficient Data Types

In [88]:
df = pd.DataFrame({
    "Region": ["North", "South", "North", "South", "North"]
})

df["Region"] = df["Region"].astype("category")

print(df["Region"].dtype)

category

In [90]:
df = pd.DataFrame({
    "id": [1, 2, 3, 4],
    "price": [100.5, 200.5, 300.5, 400.5],
    "category": ["A", "B", "A", "B"]
})

df = df.astype({
    "id": "int32",
    "price": "float32",
    "category": "category"
})

print(df.dtypes)

id             int32
price        float32
category    category
dtype: object

# Query method

In [91]:
df = pd.DataFrame({
    "Product": ["A", "B", "C", "D"],
    "Sales": [100, 300, 150, 400],
    "Region": ["North", "South", "North", "South"]
})

filtered = df.query("Sales > 200 and Region == 'South'")
print(filtered)

  Product  Sales Region
1       B    300  South
3       D    400  South

In [92]:
import pandas as pd

df = pd.DataFrame({
    "Product": ["A", "B", "C", "D", "E", "F"],
    "Region": ["North", "South", "North", "South", "East", "North"],
    "Sales": [100, 300, 150, 400, 250, 500],
    "Profit": [10, 30, 15, 40, 25, 60],
    "Year": [2023, 2023, 2024, 2024, 2023, 2024]
})

df

  Product Region  Sales  Profit  Year
0       A  North    100      10  2023
1       B  South    300      30  2023
2       C  North    150      15  2024
3       D  South    400      40  2024
4       E   East    250      25  2023
5       F  North    500      60  2024

In [93]:
df.query("Sales > 200 and Profit >= 30")

  Product Region  Sales  Profit  Year
1       B  South    300      30  2023
3       D  South    400      40  2024
5       F  North    500      60  2024

In [94]:
df.query("Region == 'North' or Region == 'East'")

  Product Region  Sales  Profit  Year
0       A  North    100      10  2023
2       C  North    150      15  2024
4       E   East    250      25  2023
5       F  North    500      60  2024

In [96]:
df.query("not (Region == 'South') & not (Region =='East') ")

  Product Region  Sales  Profit  Year
0       A  North    100      10  2023
2       C  North    150      15  2024
5       F  North    500      60  2024

In [97]:
df.query("Region in ['North', 'East']")

  Product Region  Sales  Profit  Year
0       A  North    100      10  2023
2       C  North    150      15  2024
4       E   East    250      25  2023
5       F  North    500      60  2024

In [98]:
df.query("Product not in ['A', 'B']")

  Product Region  Sales  Profit  Year
2       C  North    150      15  2024
3       D  South    400      40  2024
4       E   East    250      25  2023
5       F  North    500      60  2024

In [99]:
min_sales = 200
target_year = 2024

df.query("Sales > @min_sales and Year == @target_year")

  Product Region  Sales  Profit  Year
3       D  South    400      40  2024
5       F  North    500      60  2024

In [100]:
df.query("Sales >= 200 and Sales <= 400")

  Product Region  Sales  Profit  Year
1       B  South    300      30  2023
3       D  South    400      40  2024
4       E   East    250      25  2023

In [101]:
df.query("200 <= Sales <= 400")

  Product Region  Sales  Profit  Year
1       B  South    300      30  2023
3       D  South    400      40  2024
4       E   East    250      25  2023

In [102]:
df.query("Product.str.startswith('A')")

  Product Region  Sales  Profit  Year
0       A  North    100      10  2023

In [103]:
df.query("Region.str.contains('o')")

  Product Region  Sales  Profit  Year
0       A  North    100      10  2023
1       B  South    300      30  2023
2       C  North    150      15  2024
3       D  South    400      40  2024
5       F  North    500      60  2024

In [104]:
df.query("Profit.isnull()")

Empty DataFrame
Columns: [Product, Region, Sales, Profit, Year]
Index: []

In [105]:
df.query("Profit.notnull()")

  Product Region  Sales  Profit  Year
0       A  North    100      10  2023
1       B  South    300      30  2023
2       C  North    150      15  2024
3       D  South    400      40  2024
4       E   East    250      25  2023
5       F  North    500      60  2024

In [106]:
df.query("Sales > Profit * 10")

Empty DataFrame
Columns: [Product, Region, Sales, Profit, Year]
Index: []

In [107]:
df.query("(Region == 'North' and Sales > 200) or (Region == 'South' and Profit > 35)")

  Product Region  Sales  Profit  Year
3       D  South    400      40  2024
5       F  North    500      60  2024

In [108]:
df["Region"] = df["Region"].astype("category")

df.query("Region == 'North' and Sales > 150")

  Product Region  Sales  Profit  Year
5       F  North    500      60  2024

In [109]:
df.query("Year == 2024") \
  .sort_values("Sales", ascending=False) \
  .head(2)

  Product Region  Sales  Profit  Year
5       F  North    500      60  2024
3       D  South    400      40  2024